app/controllers/clients_controller.rb

SELECT "clients".* FROM "clients"
---
  def index
    @clients = Client.all

INSERT INTO "clients" ("email", "password_digest", "name", "surname", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @new_client = Client.new(client_parameters)
    if @new_client.save

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT 1  [["id", 5]]
---
  def edit
    @client = Client.find(params[:id])

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT 1  [["id", 5]]
UPDATE "clients" SET "password_digest" = $1, "name" = $2, "phone" = $3, "updated_at" = $4 WHERE "clients"."id" = $5  [["password_digest", "$2a$10$UBNruRtbuFoFaCqc3Q4AzOunOqdo0i0etajpr9NXqLjoEq1gG.jVi"], ["name", "kokoko"], ["phone", "12345678"], ["updated_at", "2016-04-15 15:21:32.056891"], ["id", 5]]
---
  def update
    @client = Client.find(params[:id])
    if @client.update_attributes(client_parameters)

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT 1  [["id", 3]]
---
  def destroy
    @client = Client.find(params[:id])

DELETE FROM "clients" WHERE "clients"."id" = $1  [["id", 3]]
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT 1  [["id", 3]]
---
  def drop
    client = Client.find(params[:id]).destroy