app/controllers/couriers_controller.rb

SELECT "couriers".* FROM "couriers"
---
  def index
    @couriers = Courier.all

INSERT INTO "couriers" ("precinct", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["precinct", "Krowodrza"], ["created_at", "2016-04-10 19:03:59.344541"], ["updated_at", "2016-04-10 19:03:59.344541"]]
---
  def create
    @new_courier = Courier.new(courier_parameters)
    if @new_courier.save

SELECT  "couriers".* FROM "couriers" WHERE "couriers"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @courier = Courier.find(params[:id])

SELECT  "couriers".* FROM "couriers" WHERE "couriers"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "couriers" SET "precinct" = $1, "updated_at" = $2 WHERE "couriers"."id" = $3  [["precinct", "TESTER_2"], ["updated_at", "2016-04-12 10:36:18.598022"], ["id", 4]]
---
  def update
    @courier = Courier.find(params[:id])
    if @courier.update_attributes(courier_parameters)

SELECT  "couriers".* FROM "couriers" WHERE "couriers"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @courier = Courier.find(params[:id])

SELECT  "couriers".* FROM "couriers" WHERE "couriers"."id" = $1 LIMIT 1  [["id", 4]]
---
  def destroy
    @courier = Courier.find(params[:id])

DELETE FROM "couriers" WHERE "couriers"."id" = $1  [["id", 4]]
SELECT  "couriers".* FROM "couriers" WHERE "couriers"."id" = $1 LIMIT 1  [["id", 4]]
---
  def drop
    courier = Courier.find(params[:id]).destroy