app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT "users".* FROM "users"

  def show
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 15]]

  def edit
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 15]]

  def update
    user = User.find(params[:id])
    if user.update_attributes(user_update_parameters)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 15]]
UPDATE "users" SET "email" = $1, "password_digest" = $2, "position" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["email", "kkjnfrin"], ["password_digest", "$2a$10$IoSyf/5Kvu9pF1YJTSUMf.R1HcTWZwU9u.8QQqzqELk.G/YF5xTca"], ["position", "Kurier"], ["updated_at", "2016-04-12 20:41:37.294350"], ["id", 15]]

  def destroy
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 4]]

  def drop
    user = User.find(params[:id]).destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 4]]