app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "name", "surname", "position", "birth_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @new_user = User.new(user_parameters)
    if @new_user.save