app/controllers/warehouses_controller.rb

INSERT INTO "warehouses" ("name", "address", "capacity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Magazyn Pierwszy"], ["address", "Kraków, mazowiecka 104"], ["capacity", 1000], ["created_at", "2016-04-08 18:31:11.586340"], ["updated_at", "2016-04-08 18:31:11.586340"]]
---
  def create
    @new_warehouse = Warehouse.new(warehouse_parameters)
    if @new_warehouse.save

UPDATE "warehouses" SET "name" = $1, "updated_at" = $2 WHERE "warehouses"."id" = $3  [["name", "Trzeci magazyn"], ["updated_at", "2016-04-08 18:42:54.861136"], ["id", 3]]
---
  def update
    @warehouse = Warehouse.find(params[:id])
    if @warehouse.update_attributes(warehouse_parameters)

DELETE FROM "warehouses" WHERE "warehouses"."id" = $1  [["id", 2]]
---
  def drop
    warehouse = Warehouse.find(params[:id]).destroy